#### Prod Environment Plan 📖
<details><summary>Show Plan</summary>
```terraform
module.backend.data.archive_file.webhook_zip: Reading...
module.backend.data.archive_file.stripe_layer_zip: Reading...
module.backend.data.archive_file.lambda_zip: Reading...
module.backend.data.archive_file.lambda_zip: Read complete after 0s [id=b76ef36d86b36c4f8cba8621da7eb98b79b6a324]
module.backend.data.archive_file.webhook_zip: Read complete after 0s [id=35c3a375dc4f230d2b0d79976a75a11a1c47a146]
module.backend.aws_api_gateway_rest_api.api: Refreshing state... [id=ps1frit3ub]
module.backend.aws_iam_role.lambda_role: Refreshing state... [id=vstshop-lambda-role-prod]
module.database.aws_dynamodb_table.purchases: Refreshing state... [id=vstshop-purchases-prod]
module.frontend.aws_s3_bucket.frontend: Refreshing state... [id=vstshop-frontend-prod123]
module.frontend.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E3LS99DT2QX8JW]
module.storage.aws_s3_bucket.vst_storage: Refreshing state... [id=vst-storage-prod-195481994910]
module.auth.aws_cognito_user_pool.pool: Refreshing state... [id=us-east-2_u7h4b6cDw]
module.backend.data.archive_file.stripe_layer_zip: Read complete after 0s [id=54434a34228936805c00fff493738d1327546722]
module.backend.aws_lambda_layer_version.stripe_layer: Refreshing state... [id=arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod:1]
module.backend.aws_api_gateway_resource.webhook: Refreshing state... [id=z1n13q]
module.backend.aws_api_gateway_resource.check_vst: Refreshing state... [id=vbbeey]
module.backend.aws_api_gateway_method.webhook_post: Refreshing state... [id=agm-ps1frit3ub-z1n13q-POST]
module.backend.module.api_cors.aws_api_gateway_method._: Refreshing state... [id=agm-ps1frit3ub-vbbeey-OPTIONS]
module.auth.aws_cognito_user_pool_domain.main: Refreshing state... [id=vstshop-prod-vst-prod-123]
module.backend.aws_api_gateway_authorizer.cognito: Refreshing state... [id=ef4w2c]
module.backend.module.api_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-ps1frit3ub-vbbeey-OPTIONS-200]
module.backend.module.api_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-ps1frit3ub-vbbeey-OPTIONS]
module.backend.aws_api_gateway_method.check_vst_get: Refreshing state... [id=agm-ps1frit3ub-vbbeey-GET]
module.backend.aws_lambda_function.stripe_webhook: Refreshing state... [id=vstshop-stripe-webhook-prod]
module.backend.module.api_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ps1frit3ub-vbbeey-OPTIONS-200]
module.backend.aws_lambda_permission.apigw_webhook: Refreshing state... [id=AllowExecutionFromAPIGatewayWebhook]
module.backend.aws_api_gateway_integration.webhook_integration: Refreshing state... [id=agi-ps1frit3ub-z1n13q-POST]
module.storage.aws_s3_bucket_public_access_block.vst_storage_block: Refreshing state... [id=vst-storage-prod-195481994910]
module.backend.aws_iam_policy.lambda_combined_policy: Refreshing state... [id=arn:aws:iam::212984412001:policy/vstshop-lambda-combined-policy-prod]
module.backend.aws_lambda_function.vst_checker: Refreshing state... [id=vstshop-vst-checker-prod]
module.frontend.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=vstshop-frontend-prod123]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2LWH7IMK7IDCO]
module.backend.aws_iam_role_policy_attachment.lambda_attach: Refreshing state... [id=vstshop-lambda-role-prod/arn:aws:iam::212984412001:policy/vstshop-lambda-combined-policy-prod]
module.frontend.aws_s3_bucket_policy.frontend_policy: Refreshing state... [id=vstshop-frontend-prod123]
module.storage.aws_s3_bucket_cors_configuration.vst_cors: Refreshing state... [id=vst-storage-prod-195481994910]
module.auth.aws_cognito_user_pool_client.client: Refreshing state... [id=722e9mqi8aag4njin0oafbbe8s]
module.backend.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.backend.aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-ps1frit3ub-vbbeey-GET]
module.backend.aws_api_gateway_deployment.deployment: Refreshing state... [id=ic3712]
module.backend.aws_api_gateway_stage.this: Refreshing state... [id=ags-ps1frit3ub-prod]
local_file.env_file: Refreshing state... [id=ead1c6c86ca5e4290153c72cdfd108aa015f7801]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # local_file.env_file will be created
  + resource "local_file" "env_file" {
      + content              = <<-EOT
            VITE_AWS_REGION=us-east-2
            VITE_USER_POOL_ID=us-east-2_u7h4b6cDw
            VITE_USER_POOL_CLIENT_ID=722e9mqi8aag4njin0oafbbe8s
            VITE_API_URL=https://ps1frit3ub.execute-api.us-east-2.amazonaws.com/prod
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./../../../../services/vstshop-frontend/.env"
      + id                   = (known after apply)
    }

  # module.backend.aws_lambda_function.stripe_webhook will be updated in-place
  ~ resource "aws_lambda_function" "stripe_webhook" {
        id                             = "vstshop-stripe-webhook-prod"
      ~ last_modified                  = "2026-02-18T21:29:02.811+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod:1",
        ] -> (known after apply)
      ~ source_code_hash               = "7jvgowVivf/6+JmQLkgRS9ALSy0fNz5arZFPErUTLWc=" -> "PAG8902+hDW/BARObuobVjazAMy90I+Jbj+C6kJzxQA="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_layer_version.stripe_layer must be replaced
+/- resource "aws_lambda_layer_version" "stripe_layer" {
      ~ arn                         = "arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod:1" -> (known after apply)
      ~ code_sha256                 = "haUauGh4eV4s4H2sRfpmDIXSMJzwYCYlpOxlfo+Kr80=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-02-18T21:29:02.563+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "haUauGh4eV4s4H2sRfpmDIXSMJzwYCYlpOxlfo+Kr80=" -> "ZrGNX/4UghpFn+qEMfMOA+YpTcaTXAMj2Q1axMul9Nk=" # forces replacement
      ~ source_code_size            = 4677795 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>